
#Функция кодирования текста в последовательность кода морзе
def encode_morse(string):
    #словарь для хранения соответствия каждому символу последовательность кодов морзе
    char_to_dots = {
  'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
  'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
  'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
  'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
  'Y': '-.--', 'Z': '--..', ' ': ' ', '0': '-----',
  '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
  '6': '-....', '7': '--...', '8': '---..', '9': '----.',
  '&': '.-...', "'": '.----.', '@': '.--.-.', ')': '-.--.-', '(': '-.--.',
  ':': '---...', ',': '--..--', '=': '-...-', '!': '-.-.--', '.': '.-.-.-',
  '-': '-....-', '+': '.-.-.', '"': '.-..-.', '?': '..--..', '/': '-..-.', ' ':' '
}
    #создание списка последовательностей кодов морзе из строки "string" с помощью генератора списков в котором каждая буква исходной строки заменяется последовательностью морзе
    arrMorse = [char_to_dots[i] for i in string]
    
    #объединение списка последовательностей кодов морзе в единую строку с разделителем ' ' с помощью метода "join" класса "String"
    result = ' '.join(arrMorse)
    
    return result


print(encode_morse("EDABBIT CHALLENGE"))

print(encode_morse("HELP ME!"))
